app/views/conferences/show.html.erb

			<div>
				<% @conference.speakers.each do |speaker| %>
---
SELECT "speakers".* FROM "speakers" INNER JOIN "events" ON "speakers"."id" = "events"."speaker_id" WHERE "events"."conference_id" = ?  [["conference_id", "2"]]

							<div class='speech-info'>
								<%= speaker.events.where(conference: @conference)[0].title%>
---
SELECT "events".* FROM "events" WHERE "events"."speaker_id" = ? AND "events"."conference_id" = '1'  [["speaker_id", "1"]]