app/controllers/conferences_controller.rb

  def index
    @conferences = Conference.all
---
SELECT "conferences".* FROM "conferences"

    def set_conference

      if(params[:name].to_i.to_s === params[:name].to_s)
        @conference = Conference.find(params[:name])
---
SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = ? LIMIT 1  [["id", 1]]