app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts"
---
  def index
    @contacts = Contact.all

INSERT INTO "contacts" ("name", "surname", "telephone", "email", "skype", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save