app/controllers/event_types_controller.rb

  def index
    @event_types = EventType.all
---
SELECT "event_types".* FROM "event_types"

  def create
    @event_type = EventType.new(event_type_params)

    respond_to do |format|
      format.js { render :file => "event_types2.js.erb" }
      if @event_type.save
---
INSERT INTO "event_types" ("name", "description", "defaultDuration", "color", "image", "speakerEvent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @event_type.update(event_type_params)
---
UPDATE "event_types" SET "defaultDuration" = ?, "updated_at" = ? WHERE "event_types"."id" = ?  [["defaultDuration", 1], ["updated_at", "2015-01-27 23:58:58.971305"], ["id", 4]]

  def destroy
    @event_type.destroy
---
DELETE FROM "event_types" WHERE "event_types"."id" = ?  [["id", 1]]

    def set_event_type
      @event_type = EventType.find(params[:id])
---
SELECT  "event_types".* FROM "event_types" WHERE "event_types"."id" = ? LIMIT 1  [["id", 4]]