app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index
    #@conference = Conference.find(params[:conference_id])
    #@location = @conference.location
    @locations = Location.all

INSERT INTO "locations" ("address", "conference_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["address", "Pasternaka 5, Lviv"], ["conference_id", 1], ["created_at", "2015-01-26 22:32:28.314559"], ["updated_at", "2015-01-26 22:32:28.314559"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["latitude", 49.8327337], ["longitude", 23.9992261], ["updated_at", "2015-01-26 22:39:13.618372"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_location
      @location = Location.find(params[:id])