app/controllers/speakers_controller.rb

  def index
    @speakers = Speaker.all
---
SELECT "speakers".* FROM "speakers"

    def set_speaker
      if(params[:name].to_i.to_s === params[:name].to_s)
        @speaker = Speaker.find(params[:name])
---
SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = ? LIMIT 1  [["id", 1]]