app/views/speakers/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."speaker_id" = ?  ORDER BY "events"."timeStart" DESC  [["speaker_id", "1"]]
---

		<% @speaker.events.order(timeStart: :desc).each do |speech| %>