app/views/speakers/show.html.erb

	<% sorted_events = [] %>
	<% @speaker.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."speaker_id" = ?  [["speaker_id", "1"]]